_posts/2015-06-29-数据库杂记.html
---
layout : post
title : 数据库杂记
categories : 未分类
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Subquery and Dreived-Tables</a>
<ul>
<li><a href="#sec-1-1">1.1. Subquery</a></li>
<li><a href="#sec-1-2">1.2. Derived-Tables</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
记录一些概念性的东西。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="http://www.databasejournal.com/features/mysql/article.php/3914401/Use-Derived-Tables-in-Your-MySQL-Queries-to-Improve-Database-Performance.htm">Subquery and Dreived-Tables</a></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Subquery</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A subquery is defined as any query that appears within another SQL command.
These can be further broken down into two kinds of subqueries:
</p>

<ul class="org-ul">
<li><b>stand-alone sub-queries:</b><br  />
  The ones that can run independent of the command that contains it
</li>

<li><b>correlated sub-queries:</b><br  />
  which relate to fields from the containing command.
</li>
</ul>

<p>
The most common use for subqueries is <b>filtering data</b> in the <code>WHERE</code> clause of a SQL
command or in the column list.
</p>

<p>
Here’s a subquery that retrieves a list of all customers who placed orders in the
specified year. The main query uses that list to find the reverse - those who didn't
order in that year:
</p>

<div class="org-src-container">

<pre class="src src-sql"><span class="linenr">1: </span><span style="color: #ff4040;">SELECT</span> CompanyName
<span class="linenr">2: </span><span style="color: #32cd32;">FROM</span>   Customers
<span class="linenr">3: </span><span style="color: #ff4040;">WHERE</span>  CustomerID <span style="color: #ff4040;">NOT</span> <span style="color: #32cd32;">IN</span> (<span style="color: #ff4040;">SELECT</span> CustomerID
<span class="linenr">4: </span>                          <span style="color: #32cd32;">FROM</span>   Orders
<span class="linenr">5: </span>                          <span style="color: #ff4040;">WHERE</span>  <span style="color: #32cd32;">YEAR</span>(OrderDate) = 2003);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Derived-Tables</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Compare the previous query to the following one:
</p>

<div class="org-src-container">

<pre class="src src-sql"><span class="linenr">1: </span><span style="color: #ff4040;">SELECT</span> u.last_name,
<span class="linenr">2: </span>       a.<span style="color: #ff4040;">state</span>
<span class="linenr">3: </span><span style="color: #32cd32;">FROM</span>   <span style="color: #32cd32;">User</span> <span style="color: #ff4040;">AS</span> u,
<span class="linenr">4: </span>       (<span style="color: #ff4040;">SELECT</span> user_id, <span style="color: #ff4040;">state</span> <span style="color: #32cd32;">FROM</span> Address) <span style="color: #ff4040;">AS</span> a
<span class="linenr">5: </span><span style="color: #ff4040;">WHERE</span>  u.id = a.user_id;
</pre>
</div>

<p>
The above query selects directly from the derived table created by the subquery.
</p>
</div>
</div>
</div>
